Revit 2027 API
RebarBarType.GetCrankRatio Method
 Gets the crank ratio taking into account the specified Rebar Crank Type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetCrankRatio(
	ElementId rebarCrankTypeId
)
Public Function GetCrankRatio (
	rebarCrankTypeId As ElementId
) As Double
public:
double GetCrankRatio(
	ElementId^ rebarCrankTypeId
)
member GetCrankRatio :
        rebarCrankTypeId : ElementId -> float
Parameters
rebarCrankTypeId ElementId
 The Rebar Crank Type id. Interactions with Rebar Crank Types can be done with the functions in [!:Autodesk::Revit::DB::Structure::RebarCrankTypeUtils].
Return Value
Double
 Returns the crank ratio.
Exceptions
Exception | Condition
ArgumentException |  The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
ArgumentNullException |  A non-optional argument was null
Remarks
 The crank slope is 1/crankRatio.
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace